
&НаСервере
Процедура CCRM_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВыполнениеПослеОбработчиковСобытия("CCRM_УправлениеДоступностью");
	Redmine = Новый HTTPСоединение("server.prof-it.ru", , "romik", "CWTb8VSE");
	Wiki = Новый HTTPЗапрос("redmine/projects/ciret/wiki/Матрица_клиента.html");
	HTTPОтвет = Redmine.Получить(Wiki);
	Подсказка = Новый ФорматированныйДокумент;
	Подсказка.УстановитьHTML(HTTPОтвет.ПолучитьТелоКакСтроку(), Новый Структура);
	Элементы.ГруппаОбщаяИнформацияРасширеннаяПодсказка.Заголовок = Подсказка.ПолучитьФорматированнуюСтроку();
КонецПроцедуры

&НаСервере
Процедура CCRM_УправлениеДоступностью(Отказ, СтандартнаяОбработка, ДополнительныйПараметр)
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	СвойствоРоль = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Юрист (Пользователи)");
	СтрокаСвойстваРоль = Пользователь.ДополнительныеРеквизиты.Найти(СвойствоРоль);
	СвойствоДоступ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Проверено юротделом (Клиенты)");
	ЭтотПартнер = РеквизитФормыВЗначение("Объект");
	СтрокаСвойстваДоступ = ЭтотПартнер.ДополнительныеРеквизиты.Найти(СвойствоДоступ);
	РольДоступна = Ложь;
	Если ЗначениеЗаполнено(СтрокаСвойстваРоль) Тогда
		РольДоступна = СтрокаСвойстваРоль.Значение;
	КонецЕсли;                               
	РедактированиеДоступно = Истина;
	Если ЗначениеЗаполнено(СтрокаСвойстваДоступ) Тогда
		РедактированиеДоступно = НЕ СтрокаСвойстваДоступ.Значение;
	КонецЕсли;
	Если НЕ РольДоступна И НЕ РедактированиеДоступно Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура CCRM_ПриОткрытии(Отказ)
	УстановитьВыполнениеПослеОбработчиковСобытия("CCRM_ПриОткрытииПослеОбработчиковСобытия");
КонецПроцедуры

&НаКлиенте
Процедура CCRM_ПриОткрытииПослеОбработчиковСобытия(Отказ, ДополнительныйПарамет)
	CCRM_ПриОткрытииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура CCRM_ПриОткрытииНаСервере()
	//Вставить содержимое обработчика
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	СвойствоРоль = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Юрист (Пользователи)");
	СтрокаСвойстваРоль = Пользователь.ДополнительныеРеквизиты.Найти(СвойствоРоль);
	СвойствоДоступ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Проверено юротделом (Клиенты)");
	ЭтотПартнер = РеквизитФормыВЗначение("Объект");
	СтрокаСвойстваДоступ = ЭтотПартнер.ДополнительныеРеквизиты.Найти(СвойствоДоступ);
	РольДоступна = Ложь;
	Если ЗначениеЗаполнено(СтрокаСвойстваРоль) Тогда
		РольДоступна = СтрокаСвойстваРоль.Значение;
	КонецЕсли;                               
	Если НЕ РольДоступна Тогда
		Переменная = Истина;
	КонецЕсли;
КонецПроцедуры
