&НаСервере
Процедура CCRM_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВыполнениеПослеОбработчиковСобытия("CCRM_УправлениеДоступностью");
КонецПроцедуры

&НаСервере
Процедура CCRM_УправлениеДоступностью(Отказ, СтандартнаяОбработка, ДополнительныйПараметр)
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	СвойствоРоль = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Юрист (Пользователи)");
	СтрокаСвойстваРоль = Пользователь.ДополнительныеРеквизиты.Найти(СвойствоРоль);
	СвойствоДоступ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Проверено юротделом (Клиенты)");
	СтрокаСвойстваДоступ = Объект.Партнер.ДополнительныеРеквизиты.Найти(СвойствоДоступ);
	РольДоступна = Ложь;
	Если ЗначениеЗаполнено(СтрокаСвойстваРоль) Тогда
		РольДоступна = СтрокаСвойстваРоль.Значение;
	КонецЕсли;                               
	РедактированиеДоступно = Истина;
	Если ЗначениеЗаполнено(СтрокаСвойстваДоступ) Тогда
		РедактированиеДоступно = НЕ СтрокаСвойстваДоступ.Значение;
	КонецЕсли;
	Если НЕ РольДоступна И НЕ РедактированиеДоступно Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры
