
&НаСервере
Процедура CCRM_ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьВыполнениеПослеОбработчиковСобытия("КлиентПрочитать");
КонецПроцедуры

&НаСервере
Процедура CCRM_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьВыполнениеПослеОбработчиковСобытия("КлиентЗаписать");
КонецПроцедуры

&НаСервере
Процедура КлиентПрочитать(ТекущийОбъект, ДополнительныйПараметр)
	Отбор = Новый Структура;
	Отбор.Вставить("Объект", ТекущийОбъект.Ссылка);
	Отбор.Вставить("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Клиент (Планы продаж по категориям)"));
	СтруктураРесурсов = РегистрыСведений.ДополнительныеСведения.Получить(Отбор);
	Клиент = СтруктураРесурсов.Значение;
КонецПроцедуры

&НаСервере
Процедура КлиентЗаписать(ТекущийОбъект, ПараметрыЗаписи, ДополнительныйПараметр)
	МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = ТекущийОбъект.Ссылка;
	МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Клиент (Планы продаж по категориям)");
	МенеджерЗаписи.Значение = Клиент;
	МенеджерЗаписи.Записать();
	
	МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = ТекущийОбъект.Ссылка;
	МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Сумма (Планы продаж по категориям)");
	МенеджерЗаписи.Значение = ТекущийОбъект.ТоварныеКатегории.Итог("Количество");
	МенеджерЗаписи.Записать();
КонецПроцедуры
