
&НаСервере
Процедура CCRM_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда
		Если Параметры.ЗначенияЗаполнения.Свойство("ИзКалендаря") Тогда
			ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Вид встречи (Встречи)"));
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.ВидВстречи.ПараметрыВыбора = НовыеПараметры;
КонецПроцедуры

&НаСервере
Процедура CCRM_ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьВыполнениеПослеОбработчиковСобытия("ВидВстречиПрочитать");
КонецПроцедуры

&НаСервере
Процедура CCRM_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьВыполнениеПослеОбработчиковСобытия("ВидВстречиЗаписать");
КонецПроцедуры

&НаСервере
Процедура ВидВстречиПрочитать(ТекущийОбъект, ДополнительныйПараметр)
	Отбор = Новый Структура;
	Отбор.Вставить("Объект", ТекущийОбъект.Ссылка);
	Отбор.Вставить("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Вид встречи (Встречи)"));
	СтруктураРесурсов = РегистрыСведений.ДополнительныеСведения.Получить(Отбор);
	ВидВстречи = СтруктураРесурсов.Значение;
КонецПроцедуры

&НаСервере
Процедура ВидВстречиЗаписать(ТекущийОбъект, ПараметрыЗаписи, ДополнительныйПараметр)
	МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = ТекущийОбъект.Ссылка;
	МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Вид встречи (Встречи)");
	МенеджерЗаписи.Значение = ВидВстречи;
	МенеджерЗаписи.Записать();
КонецПроцедуры
