
&НаКлиенте
Процедура CCRM_ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.Контрагент.Видимость = Ложь;
	ЭтаФорма.Элементы.КонтактноеЛицо.Видимость = Ложь;
	ЭтаФорма.Элементы.Соглашение.Видимость = Ложь;
	ЭтаФорма.Элементы.ХозяйственнаяОперация.Видимость = Ложь;	

КонецПроцедуры

&НаКлиенте
Процедура CCRM_ЗагрузитьИзФайлаПеред(Команда)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Прочитать табличный документ из файла";
	ДиалогВыбораФайла.Фильтр    = "Табличный документ (*.mxl)|*.mxl|Лист Excel (*.xls)|*.xls|Лист Excel 2007-...(*.xlsx)|*.xlsx";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("CCRM_ЗагрузитьИзФайлаПередНаСервере", ЭтаФорма, Объект);
	
	НачатьПомещениеФайла(ОписаниеОповещения, , ДиалогВыбораФайла, Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура CCRM_ЗагрузитьИзФайлаПередНаСервере(Результат, Адрес, ИмяФайла, Объект)
	КС50 = Новый КвалификаторыСтроки(50);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС50 = Новый ОписаниеТипов("Строка", , КС50);
	
	ТД = Новый ТабличныйДокумент;
	ПозицияРасширения = СтрНайти(ИмяФайла, ".", НаправлениеПоиска.СКонца);
	Расширение = Сред(ИмяФайла, ПозицияРасширения+1, СтрДлина(ИмяФайла)-ПозицияРасширения);
	ВременныйФайл = ПолучитьИмяВременногоФайла(Расширение);
	ПолучитьИзВременногоХранилища(Адрес).Записать(ВременныйФайл);
	ТД.Прочитать(ВременныйФайл);
	Область = ТД.Область(1,,1);
	//ТД.ВставитьОбласть(Область, Область, ТипСмещенияТабличногоДокумента.ПоВертикали);
	Для Н = 1 По ТД.ШиринаТаблицы Цикл
		ТД.Область(1,Н).Текст = "Колонка"+Формат(Н, "ЧЦ=2; ЧВН=");
	КонецЦикла;
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТД.Область(1, , ТД.ВысотаТаблицы));
	Построитель.Выполнить();
	
	ТаблицаДанных = Построитель.Результат.Выгрузить();
	ТаблицаДанных.Колонки[0].Имя  = "Артикул";
	ТаблицаДанных.Колонки[1].Имя  = "Цена";
	
	СменитьТипКолонки("Артикул", ТаблицаДанных, ОписаниеТиповС50);
		
	УдалитьФайлы(ВременныйФайл);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДанных.Артикул КАК Артикул,
	|	ТаблицаДанных.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_ТаблицаДанных
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ВТ_ТаблицаДанных.Цена КАК Цена
	|ИЗ
	|	ВТ_ТаблицаДанных КАК ВТ_ТаблицаДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ_ТаблицаДанных.Артикул = Номенклатура.Артикул"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	
	ТаблицаЗаполнения = Запрос.Выполнить().Выгрузить();
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.Товары.Загрузить(ТаблицаЗаполнения);
	ЗначениеВРеквизитФормы(Документ, "Объект");
КонецПроцедуры

#Область ЧТЕНИЕ_ТАБЛИЧНЫХ_ДАННЫХ
&НаСервере
Процедура СменитьТипКолонки(ИмяКолонки, ТабЗнач, ТипКолонки)
	
	Перем ДанныеКолонки;
	
	ДанныеКолонки = ТабЗнач.ВыгрузитьКолонку(ИмяКолонки);
	ТабЗнач.Колонки.Удалить(ИмяКолонки);
	ТабЗнач.Колонки.Добавить(ИмяКолонки, ТипКолонки);
	Если ТипКолонки.СодержитТип(Тип("Строка")) Тогда
		Для Н = 0 По ДанныеКолонки.Количество()-1 Цикл
			ДанныеКолонки[Н] = Формат(ДанныеКолонки[Н], "ЧГ=");
		КонецЦикла;
	ИначеЕсли ТипКолонки.СодержитТип(Тип("Дата")) Тогда
		Для Н = 0 По ДанныеКолонки.Количество()-1 Цикл
			ДанныеКолонки[Н] = Дата(Сред(ДанныеКолонки[Н],7,4), Сред(ДанныеКолонки[Н],4,2), Сред(ДанныеКолонки[Н],1,2));
		КонецЦикла;
	КонецЕсли;
	ТабЗнач.ЗагрузитьКолонку(ДанныеКолонки, ИмяКолонки);

КонецПроцедуры
#КонецОбласти
